Revit 2027 API
ParameterTypeId.StructConnectionBeamEnd Property
 "End Connection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructConnectionBeamEnd { get; }
Public Shared ReadOnly Property StructConnectionBeamEnd As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructConnectionBeamEnd {
	ForgeTypeId^ get ();
}
static member StructConnectionBeamEnd : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace